DeviceProcessEvents
| where InitiatingProcessFolderPath contains "rclone.exe"
| where InitiatingProcessFileName =="powershell.exe" or InitiatingProcessFileName =="cmd.exe" or InitiatingProcessFileName =="pwsh.exe"
| where ProcessCommandLine has_any("pass","user","copy","mega","sync","config","lsd","remote","ls","pcloud","ftp","ignore-existing","auto-confirm","transfers","multi-thread-streams","no-check-certificate")
