// Ping Castle is a tool designed to assess quickly the Active Directory security level with a methodology based on risk assessment and a maturity framework. It does not aim at a perfect evaluation but rather as an efficiency compromise.
// https://github.com/vletoux/pingcastle
DeviceFileEvents | where FileName =="PingCastle.exe" and ActionType =="FileCreated"
